# Вывести количество звездочек

n = int(input("Введите количество звездочек "))
a = 0
while a <= n:
    print('*' * a)
    a+=1