"""Вывести квадрат из звезд"""

n = int(input("Введите количество звездочек: "))
for i in range(n):
    print('* '*n)